lib/blogapp/writers/authors/article_writer.rb

SELECT `articles`.* FROM `articles` WHERE `articles`.`author_id` = 12
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 12 LIMIT 1
---
        def find_article(resource)
          return Author.find(resource).articles