lib/blogapp/writers/authors/authors_writer.rb

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 12 LIMIT 1
---
        def single(resource)
          return Author.find(resource)