app/views/articles/edit.html.erb

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 11 LIMIT 1
---
		<td>
			<%= form.collection_select :author, @authors.all, :id, :first_name, {:selected => @article.author.id } %>