app/views/articles/index.html.erb

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1
---
		<td><%= article.title %></td>
		<td><%= article.author.first_name %></td>

SELECT `articles`.* FROM `articles`
---

    <%= select_tag "article[]", options_for_select(@cols.collect{|x| [x]}), {:multiple => :multiple, :size => 10} %>