app/views/articles/new.html.erb

		<td>
			<%= form.collection_select :author, @authors.all, :id, :first_name %>
---
SELECT `authors`.* FROM `authors`