app/views/articles/show.html.erb

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1
---
		<td><%= @article.title %></td>
		<td><%= @article.author.first_name %></td>