app/views/users/index.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`user_type` != 'Management'
---

  <% if current_user.present? && %w(Admin Management Hiring\ Manager).include?(current_user.user_type) %>