lib/blogapp/writers/articles/articles_writer.rb

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 17 LIMIT 1
---
        def single(resource)
          return Article.find(resource)

SELECT `articles`.* FROM `articles` ORDER BY title ASC
---
        def single_col(resource)
          return "#{Article.pluck resource}"