lib/blogapp/writers/articles/author_writer.rb

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 17 LIMIT 1
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 12 LIMIT 1
---
        def find_author(resource)
          return Article.find(resource).author