app/policies/article_policy.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 13 LIMIT 1
---
  def index?
    # user.admin? or not record.published?
    # binding.pry
    # @article.user == self.user
    @articles = @article.each { |article| article.user == self.user }