app/controllers/movies/comments_controller.rb

SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
---
    def set_commentable
      @commentable = Movie.find(params[:movie_id])