app/controllers/api/v1/articles_controller.rb

SELECT `articles`.* FROM `articles`
---
      def index
        render status: 200, json: Blogapp::Writers::Articles::ArticlesWriter.new.all(), include: ['user','author']