app/controllers/api/v1/article_controller.rb

      def index
        @id = params[:author_id]
        render status: 200, json: JSON.pretty_generate(JSON.parse(Blogapp::Writers::Authors::ArticleWriter.new.find_article(@id).to_json))
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`author_id` = 12