app/controllers/api/v1/authors_controller.rb

SELECT `authors`.* FROM `authors`
---
      def index
        render status: 200, json: JSON.pretty_generate(JSON.parse(Blogapp::Writers::Authors::AuthorsWriter.new.all().to_json))