app/views/subscribers/edit.html.erb

SELECT `magazines`.`id` FROM `magazines` INNER JOIN `subscriptions` ON `magazines`.`id` = `subscriptions`.`magazine_id` WHERE `subscriptions`.`subscriber_id` = 1
---
      <li>
        <%= check_box_tag 'magazine_ids[]', magazine.id, @subscriber.magazines.ids.include?(magazine.id) ? true : false %>