app/controllers/actors_controller.rb

SELECT `actors`.* FROM `actors`
---
  def index
    @actors = Actor.all

SELECT `actors`.* FROM `actors` WHERE `actors`.`id` = 1 LIMIT 1
---
  def show
    @actor = Actor.find(params[:id])