app/controllers/articles_controller.rb

	def index
		@articles = Article.all
---
SELECT `articles`.* FROM `articles`

	def edit
		@article = Article.find(params[:id])
		@authors = Author.all
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 17 LIMIT 1
SELECT `authors`.* FROM `authors`

	def new

		puts "Inside New Action of ArticlesController"

		@authors = Author.all
---
SELECT `authors`.* FROM `authors`

	def create

		@article = Article.create(title: params[:articles][:title], author: Author.find_by(id: params[:articles][:author]), body: params[:articles][:body], url: params[:articles][:url])
---
INSERT INTO `articles` (`title`, `author`, `body`, `url`, `created_at`, `updated_at`, `authorid`) VALUES ('dscvsd', 'Author3', 'fdsvfd', 'svfsdv', '2019-10-07 11:56:02.688221', '2019-10-07 11:56:02.688221', 4)
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 11 LIMIT 1

	def update

		p = params

		puts "TESTTTT"

		puts p

		@article = Article.find_by(id: params[:id])

		@author = Author.find_by(id: params[:article][:author])

		puts "Start"
		puts @author
		puts "End"


		@article.title = params[:article][:title]
		@article.author = @author
		@article.body = params[:article][:body]
		@article.url = params[:article][:url]


		@article.save
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 16 LIMIT 1
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` IS NULL LIMIT 1
UPDATE `articles` SET `articles`.`author_id` = 12, `articles`.`updated_at` = '2019-10-16 04:59:38.922533' WHERE `articles`.`id` = 16

	def show

		@article = Article.find(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 17 LIMIT 1

	def destroy

		@article = Article.find(params[:id])

		@article.destroy
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 10 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 10