app/controllers/articles_controller.rb

UPDATE `articles` SET `articles`.`url` = 'X', `articles`.`updated_at` = '2019-11-21 08:03:25.658029' WHERE `articles`.`id` = 1
---
	def update
		@article = Article.find_by(id: params[:id])
		@author = Author.find_by(id: params[:article][:author])
		@article.title = params[:article][:title]
		@article.author = @author
		@article.body = params[:article][:body]
		@article.url = params[:article][:url]
		@article.save

DELETE FROM `articles` WHERE `articles`.`id` = 12
---
	def destroy
		@article = Article.find(params[:id])
		authorize @article
		@article.destroy