app/controllers/authors_controller.rb

SELECT `authors`.* FROM `authors`
---
	def index
		@authors = Author.all

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 4 LIMIT 1
---
	def edit
		@author = Author.find(params[:id])

INSERT INTO `authors` (`first_name`, `last_name`, `phone`, `created_at`, `updated_at`) VALUES ('', '', '9696969696', '2019-10-07 11:29:56.436545', '2019-10-07 11:29:56.436545')
---
	def create

		p = params[:authors]

		@author = Author.create(first_name: p[:first_name], last_name: p[:last_name], phone: p[:phone])

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 4 LIMIT 1
UPDATE `authors` SET `authors`.`first_name` = 'Author666', `authors`.`updated_at` = '2019-10-15 13:56:02.689978' WHERE `authors`.`id` = 11
---
	def update

		p = params

		puts "TESTTTT"

		puts p

		@author = Author.find_by(id: p[:id])


		@author.first_name = p[:author][:first_name]
		@author.last_name = p[:author][:last_name]
		@author.phone = p[:author][:phone]


		@author.save

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 2 LIMIT 1
---
	def show

		@author = Author.find(params[:id])

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 3 LIMIT 1
DELETE FROM `authors` WHERE `authors`.`id` = 3
---
	def destroy

		@author = Author.find(params[:id])

		@author.destroy