app/controllers/categorization_controller.rb

	def index

		@categories = Category.all
---
SELECT `categories`.* FROM `categories`