app/controllers/categories_controller.rb

	def index
		@categories = Category.all
---
SELECT `categories`.* FROM `categories`

	def create
		@category = Category.create(name: params[:categories][:name])
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('adasd', '2019-10-16 10:21:15.535180', '2019-10-16 10:21:15.535180')

	def edit
		@category = Category.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1

	def update
		@category = Category.find_by(id: params[:id])
		@category.name = params[:category][:name]
		@category.save
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
UPDATE `categories` SET `categories`.`name` = 'Electronics', `categories`.`updated_at` = '2019-10-16 13:14:32.575748' WHERE `categories`.`id` = 1

	def show
		@category = Category.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1

	def destroy
		@category = Category.find(params[:id])
		@category.destroy
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 4