app/controllers/comments_controller.rb

  def create
    @comment = @commentable.comments.new comment_params
    @comment.save
---
INSERT INTO `comments` (`commentable_type`, `commentable_id`, `body`, `created_at`, `updated_at`) VALUES ('Movie', 1, 'comment3', '2019-10-23 13:45:10.788237', '2019-10-23 13:45:10.788237')