app/controllers/magazines_controller.rb

	def index
		@magazines = Magazine.all
---
SELECT `magazines`.* FROM `magazines`

	def create
		@magazine = Magazine.create(name: params[:magazines][:name])
---
INSERT INTO `magazines` (`name`, `created_at`, `updated_at`) VALUES ('Magazine3', '2019-10-17 07:58:24.073381', '2019-10-17 07:58:24.073381')

	def edit
		@magazine = Magazine.find(params[:id])
---
SELECT `magazines`.* FROM `magazines` WHERE `magazines`.`id` = 1 LIMIT 1

	def update

		@magazine = Magazine.find_by(id: params[:id])

		@magazine.name = params[:magazine][:name]

		@magazine.save
---
SELECT `magazines`.* FROM `magazines` WHERE `magazines`.`id` = 1 LIMIT 1
UPDATE `magazines` SET `magazines`.`name` = 'Ruby TX', `magazines`.`updated_at` = '2019-10-17 08:00:50.144879' WHERE `magazines`.`id` = 1

	def show

		@magazine = Magazine.find(params[:id])
---
SELECT `magazines`.* FROM `magazines` WHERE `magazines`.`id` = 1 LIMIT 1

	def destroy

		@magazine = Magazine.find(params[:id])

		@magazine.destroy
---
SELECT `magazines`.* FROM `magazines` WHERE `magazines`.`id` = 3 LIMIT 1
DELETE FROM `magazines` WHERE `magazines`.`id` = 3