app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT `movies`.* FROM `movies`

  def show
    @movie = Movie.find(params[:id])
---
SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1

  def edit
  	@movie = Movie.find(params[:id])
---
SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1

  def update
  	@movie = Movie.find(params[:id])
  	@movie.update(name: params[:movie][:name])
  	@movie.update(description: params[:movie][:description])
---
SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 6 LIMIT 1
UPDATE `movies` SET `movies`.`description` = 'hello', `movies`.`updated_at` = '2019-10-30 07:11:27.696237' WHERE `movies`.`id` = 1
UPDATE `movies` SET `movies`.`description` = 'Cobb steals information from his targets by entering their dreams. He is wanted for his alleged role in his wife\'s murder and his only chance at redemption is to perform the impossible, an inception.X', `movies`.`updated_at` = '2019-10-30 07:12:21.745072' WHERE `movies`.`id` = 1

  def create
  	Movie.create(name: params[:movies][:name],description: params[:movies][:description])
---
INSERT INTO `movies` (`name`, `description`, `created_at`, `updated_at`) VALUES ('Movie 4', 'Mvoie 4 descriptions', '2019-10-30 11:27:52.175184', '2019-10-30 11:27:52.175184')

  def destroy
    Movie.find(params[:id]).destroy
---
DELETE FROM `movies` WHERE `movies`.`id` = 7
SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 7 LIMIT 1