app/controllers/products_controller.rb

SELECT `products`.* FROM `products`
---
	def index
		@products = Product.all

SELECT `categories`.* FROM `categories`
---
	def new
		@categories = Category.all

INSERT INTO `products` (`name`, `created_at`, `updated_at`) VALUES ('asf', '2019-10-16 10:56:06.778613', '2019-10-16 10:56:06.778613')
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('asf', '2019-10-16 10:55:33.195699', '2019-10-16 10:55:33.195699')
INSERT INTO `products` (`name`, `created_at`, `updated_at`) VALUES ('asdasd', '2019-10-16 11:00:49.505330', '2019-10-16 11:00:49.505330')
---
	def create

		puts params[:products]

		@product = Product.create(name: params[:products][:name])

		@category = Category.find_by(id: params[:products][:category])

		@category.products << @product

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories`
---
	def edit
		@product = Product.find(params[:id])
		@categories = Category.all

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
UPDATE `products` SET `products`.`name` = 'asfX', `products`.`updated_at` = '2019-10-16 11:08:45.133242' WHERE `products`.`id` = 8
---
	def update

		@product = Product.find_by(id: params[:id])

		@product.name = params[:product][:name]

		@product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
	def show

		@product = Product.find(params[:id])

SELECT `products`.* FROM `products` WHERE `products`.`id` = 8 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 8
---
	def destroy

		@product = Product.find(params[:id])

		@product.destroy