app/controllers/subscriptions_controller.rb

SELECT `subscribers`.* FROM `subscribers`
---
	def index
		@subscribers = Subscriber.all