app/controllers/subscribers_controller.rb

SELECT `subscribers`.* FROM `subscribers`
---
	def index
		@subscibers = Subscriber.all

SELECT `magazines`.* FROM `magazines`
---
	def new
		@magazines = Magazine.all

INSERT INTO `subscribers` (`name`, `created_at`, `updated_at`) VALUES ('Test33', '2019-10-17 09:46:45.067128', '2019-10-17 09:46:45.067128')
SELECT `subscribers`.* FROM `subscribers` WHERE `subscribers`.`id` IS NULL LIMIT 1
SELECT `magazines`.* FROM `magazines` WHERE `magazines`.`id` = 1 LIMIT 1
---
	def create

		@subscriber = Subscriber.create(name: params[:subscribers][:name])

		params[:magazine_ids].each do |magazine_id|

			@subscriber.magazines << Magazine.find_by(id: magazine_id)

SELECT `subscribers`.* FROM `subscribers` WHERE `subscribers`.`id` = 4 LIMIT 1
SELECT `magazines`.* FROM `magazines`
---
	def edit
		@subscriber = Subscriber.find(params[:id])
		@magazines = Magazine.all

SELECT `subscribers`.* FROM `subscribers` WHERE `subscribers`.`id` = 4 LIMIT 1
SELECT `subscribers`.* FROM `subscribers` WHERE `subscribers`.`id` = 1 LIMIT 1
SELECT `magazines`.* FROM `magazines` WHERE `magazines`.`id` = 1 LIMIT 1
---
	def update

		@subscriber = Subscriber.find_by(id: params[:id])

		@subscriber.magazines.clear

		params[:magazine_ids].each do |magazine_id|

			@subscriber.magazines << Magazine.find_by(id: magazine_id)

SELECT `subscribers`.* FROM `subscribers` WHERE `subscribers`.`id` = 2 LIMIT 1
---
	def show

		@subscriber = Subscriber.find(params[:id])