app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`user_type` != 'Management'
---
  def index
    #current_user.user_type == "Management" ? @users = User.where.not(:user_type => "Management") : @users = User.where.not(:user_type => ["Management","Admin"])

    @users = User.where.not(:user_type => "Management") if current_user.user_type == "Management"