app/controllers/actors/comments_controller.rb

SELECT `actors`.* FROM `actors` WHERE `actors`.`id` = 1 LIMIT 1
---
  def set_commentable
    @commentable = Actor.find(params[:actor_id])