app/views/products/new.html.erb


<%= form.collection_select :category, @categories.all, :id, :name %>
---
SELECT `categories`.* FROM `categories`