app/views/products/show.html.erb

<h3>Product: <%= label_tag 'product', @product.name %></h3>
<%= "Category : #{@product.categories.first.name}" %><br>
---
SELECT `categories`.* FROM `categories` INNER JOIN `categories_products` ON `categories`.`id` = `categories_products`.`category_id` WHERE `categories_products`.`product_id` = 1 ORDER BY `categories`.`id` ASC LIMIT 1