app/controllers/users/registrations_controller.rb

DELETE FROM `users` WHERE `users`.`id` = 34
---
  def delete_user
    User.destroy(params[:format])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 34 LIMIT 1
---
  def edit_admin
    @user = User.find(params[:id])